<?php
// +----------------------------------------------------------------------
// | ThinkPHP AI Chat [Simple AI Chat For ThinkPHP]
// +----------------------------------------------------------------------
// | ThinkPHP AI 聊天
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: axguowen <axguowen@qq.com>
// +----------------------------------------------------------------------

return [
    // 默认平台
    'default' => 'deepseek',
    // 平台配置
    'platforms' => [
        // 百度平台
        'deepseek' => [
            // 驱动类型
            'type' => 'DeepSeek',
            // API密钥
            'api_key' => '',
        ],
        // 其它
        'other' => [
            // 驱动类型
            'type' => 'QianFan',
            // API密钥
            'api_key' => '',
        ],
    ]
];
